package com.mygitgor.algorithm;

import java.io.*;

/**
 * V__3
 */
public class Cafe {

    /**
     * Около Петиного университета недавно открылось новое кафе, в котором действует следующая система скидок:
     * при каждой покупке более чем на 100 рублей покупатель получает купон,
     * дающий право на один бесплатный обед (при покупке на сумму 100 рублей и меньше такой купон покупатель не получает).
     * Однажды Пете на глаза попался прейскурант на ближайшие N дней. Внимательно его изучив, он решил,
     * что будет обедать в этом кафе все N дней, причем каждый день он будет покупать в кафе ровно один обед.
     * Однако стипендия у Пети небольшая, и поэтому он хочет по максимуму использовать предоставляемую систему скидок так,
     * чтобы его суммарные затраты были минимальны. Требуется найти минимально возможную суммарную стоимость обедов и номера дней,
     * в которые Пете следует воспользоваться купонами.
     * Ввод  Вывод
     * 5    235
     * 35   0 1
     * 40   5
     * 101
     * 59
     * 63
     */
    public static void main(String[] args) throws IOException {
        try (BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
             BufferedWriter writer = new BufferedWriter(new OutputStreamWriter(System.out)))
        {
            //TODO code hire
        }
    }

}
