package com.mygitgor.algorithm;

import java.io.*;

/**
 * V__2
 */
public class NOP {
    /**
     *Даны две последовательности, требуется найти и вывести их наибольшую общую подпоследовательность.
     *
     * Напомним:
     *
     * Последовательность x x называется подпоследовательностью последовательности y y, если x x получается из 𝑦 y удалением нескольких (возможно, нуля или всех) элементов.
     *
     * Наибольшая общая подпоследовательность - последовательность наибольшей длины, которая является подпоследовательностью обеих последовательностей.
     * Формат ввода
     *
     * В первой строке входных данных содержится число N – длина первой последовательности (1 ≤ ≤ N ≤ ≤ 1000). Во второй строке заданы члены первой последовательности (через пробел) – целые числа, не превосходящие 10000 по модулю.
     *
     * В третьей строке записано число M – длина второй последовательности (1 ≤ ≤ M ≤ ≤ 1000). В четвертой строке задаются члены второй последовательности (через пробел) – целые числа, не превосходящие 10000 по модулю.
     */
    public static void main(String[] args) throws IOException {
        try (BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
             BufferedWriter writer = new BufferedWriter(new OutputStreamWriter(System.out)))
        {
            //TODO code hire
        }
    }
}
